answer-ls/Lummiss_Plant_Robot/src/demo/sdkconfig.defaults
# ESP32-P4 和开发板存储配置
CONFIG_IDF_TARGET="esp32p4"

# BLE Wi-Fi provisioning runs the NimBLE host on P4 and uses the C6
# controller through ESP-Hosted HCI over the existing SDIO link.
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_2=y
CONFIG_NETWORK_PROV_NETWORK_TYPE_WIFI=y
CONFIG_NETWORK_PROV_AUTOSTOP_TIMEOUT=5
CONFIG_NETWORK_PROV_BLE_SEC_CONN=y
# The current C6 runs ESP-Hosted 2.3.x while the P4 host uses 2.7.x. Stop
# advertising and disconnect the provisioning client after success, but keep
# the idle BLE stack alive until the C6 firmware is upgraded and teardown is
# revalidated with matching Host/Slave versions.
CONFIG_NETWORK_PROV_KEEP_BLE_ON_AFTER_PROV=y
CONFIG_NETWORK_PROV_DISCONNECT_AFTER_PROV=y
# 当前 JC1060P470C 开发板实测芯片为 ESP32-P4 v1.3。
# P4 v1.x 与 v3.x 的程序不兼容，必须选择低于 v3.0 的硬件分支。
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# 开发板带 32 MB PSRAM，摄像头帧缓冲使用外部内存。
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=200000

# WebSocket 视频上行阻塞时允许下行 Opus 并发接收，避免共用锁造成语音断粮。
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
CONFIG_ESP_WS_CLIENT_TX_LOCK_TIMEOUT_MS=2000
# H.264 每帧回写约 720 KB 输入。分成 16 KB 缓存同步临界区，
# 避免 USB HCD 在另一核等待缓存锁时长时间无法服务 ISOC。
CONFIG_ESP_MM_CACHE_MSYNC_C2M_CHUNKED_OPS=y
CONFIG_ESP_MM_CACHE_MSYNC_C2M_CHUNKED_OPS_MAX_LEN=0x4000
# USB-DWC 内部 DMA 可访问 PSRAM：让 UVC 收流的 URB 数据缓冲落 PSRAM。
# 必须落 PSRAM：8 x 18432 B = 144 KiB，而内部 DMA 池只有 146 KiB
# （见启动日志 "Reserving pool of 146K of internal memory for DMA"）。codec-only
# 档位能刚好塞下，完整档位的 WiFi(SDIO)/LVGL/LCD SPI 会先占用该池，分配必然失败；
# 而分配失败又会被组件的 double-free 放大成开机重启循环（uvc_host.c:341 的
# uvc_transfers_free 释放后不置空，被 uvc_host_stream_open 的错误路径二次调用）。
# 代价是 6~10% UVC 丢帧；20 fps 门控下 30 fps 丢 10% 仍有约 27 fps，不影响帧率。
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y

# 为测试任务和 USB Host 保留足够栈空间及控制传输缓冲区。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y
# 完整 USB/UVC 描述符有数百行，只在定位枚举兼容问题时临时打开。
CONFIG_PRINTF_UVC_CONFIGURATION_DESCRIPTOR=n

# LVGL 8 使用 RGB565；SPI 屏按高字节在前接收，因此在刷新前交换颜色字节。
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_SIMSUN_16_CJK=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_LV_BUILD_EXAMPLES=n

# 默认发送缓冲只有 5760 字节（= 4×MSS），一帧 H.264 约 17KB 装不下，一次
# esp_websocket_client_send_bin() 要分三个 RTT 才能推完（实测 WS=46.9ms ≈
# 3×15.6ms，正好对上）。改成 65535 后整帧一次进队列，耗时收敛到 1 个 RTT。
# 上限只能是 65535：LWIP_WND_SCALE 依赖 SPIRAM_TRY_ALLOCATE_WIFI_LWIP（未开），
# Kconfig 走 `range 2440 65535` 分支，写 65536 会被判非法。
# 段池 MEMP_NUM_TCP_SEG 默认 16 不构成限制——lwipopts.h 开了 MEMP_MEM_MALLOC，
# 池是堆分配、无数量上限，真正的闸门是 TCP_SND_BUF 和由它推出的 TCP_SND_QUEUELEN。
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535

# LVGL 动态对象使用系统 malloc；表情播放器的两个 RGB565 帧缓冲由
# anim_bin_player 明确一次性分配到 PSRAM，不再启用 GIF/文件系统解码器。
CONFIG_LV_MEM_CUSTOM=y
# CONFIG_LV_USE_GIF is not set
# CONFIG_LV_USE_FS_POSIX is not set

# 卡上的素材目录是 expressions/，11 个字符超过 8.3；文件名 exp_01.bin 是 8.3。
# 默认只认短名，按 "expressions" 打不开（FATFS 看到的是 EXPRESS~1）。
CONFIG_FATFS_LONG_FILENAMES=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# FatFS 的扇区缓存放内部 RAM，避免零散读写因 PSRAM 128 字节对齐要求
# 触发临时 DMA Buffer。动画整帧读取另由 4 KB 内部 DMA Buffer 分块完成。
# CONFIG_FATFS_ALLOC_PREFER_EXTRAM is not set

# 板载 ESP32-C6 网络协处理器：ESP-Hosted 通过 SDIO Slot 1 通信。
# 引脚和时钟来自同型号 JC1060P470C 厂商的小智示例。
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=19
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=18
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=14
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=15
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=16
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=17
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SLAVE_RESET_ON_EVERY_HOST_BOOTUP=y
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=54
CONFIG_ESP_HOSTED_USE_MEMPOOL=y

# ESP32-P4 使用远端 WiFi API，具体无线协议栈运行在 ESP32-C6 上。
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# 同型号 JC1060P470C 厂商示例的板载 ES8311 音频配置。
CONFIG_CODEC_ES8311_SUPPORT=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

# 小智服务、麦克风和扬声器任务使用 PSRAM 栈，避免继续挤占
# USB/WiFi 共用的内部 DMA 内存；PCM DMA 缓冲仍在内部 RAM。

# 关掉硬件 AES —— 这是 P4 上唯一能把 AES 那条 DMA 描述符路径整个摘掉的开关。
#
# 起因：实机报 `esp-aes: Failed to allocate memory for len buffer`，随后 TLS 写
# 失败、WS 断连，再往后 JPEG_DEC 从 15 ms 涨到 662 ms、编码掉到 0 fps。
#
# 为什么 AES 会去啃内部 DMA 池：P4 上 AES 走的是 port/aes/dma/esp_aes.c。走哪份
# esp_aes.c 由 CMakeLists 的 AES_PERIPHERAL_TYPE 决定，而它只看 SOC 能力
# CONFIG_SOC_AES_SUPPORT_DMA —— **没有 Kconfig 可选**。于是 esp_aes_process_dma()
# 对每一次 AES 运算都要调两遍 generate_descriptor_list()，从
# MALLOC_CAP_DMA|MALLOC_CAP_INTERNAL 里 heap_caps_aligned_calloc 出描述符数组和
# 最多两个对齐缓冲；这条路径没有“小缓冲区直通”的捷径，16 字节的 ECB 也一样。
# 也就是说无论用哪种密码套件，每个 TLS 记录都要和 UVC/WiFi 抢同一块 146 KiB 的
# 池子（开机日志 "Reserving pool of 146K of internal memory for DMA"）。
#
# 先只关了 MBEDTLS_HARDWARE_GCM，没用：AES 有**两个**描述符消费者，GCM 那条
# (esp_aes_process_dma_gcm) 只是其中之一，通用那条 esp_aes_process_dma() 仍在每个
# 记录上分配。关了 GCM 只是把报错从 "len buffer" 换成 "start/end alignment
# buffer"——错误换了个函数照样出，页面上的现象一点没变。
#
# 更要紧的是这条路径**失败即泄漏**：esp_aes_dma_core.c 里 GCM 的 len_desc/len_buf
# 分配失败时是裸 `return -1`，跳过了函数末尾的 cleanup:，而 aad/input/output 三组
# 描述符和 6 个 alignment buffer 此时都已分配成功。失败一次池子就永久小一截，
# 下一次更容易失败——正好解释现象为什么是单向恶化而不是偶发抖动。
#
# CONFIG_MBEDTLS_HARDWARE_AES=n 时 port/include/mbedtls/esp_config.h:152 不再定义
# MBEDTLS_AES_ALT 与 MBEDTLS_GCM_ALT，mbedtls 完全走自己的软件 aes.c / gcm.c，
# 上面那条路径一次都不会被调到（本工程没有 flash 加密/NVS 加密，也没有别处直接
# 调 esp_aes_*）。代价是纯软件 AES——GHASH 本来就是软件算的：实测 TLS 流量约
# 4 Mbps，软件 AES 在 400 MHz RISC-V 上约 10 MB/s，占不到一个核的 5%。
CONFIG_MBEDTLS_HARDWARE_AES=n

# ESP-SR 唤醒词检测：AFE 语音前端 + WakeNet9（"你好小智"）。
# 模型编译进固件 → 运行时从 SPIFFS "model" 分区加载。
CONFIG_AFE_INTERFACE_V1=y
CONFIG_SR_WN_WN9_NIHAOXIAOZHI_TTS=y